In [103]:
# Data cleaning

In [104]:
import pandas as pd

In [105]:
data = pd.DataFrame({'a': [1, pd.NA ], 'b': [3, 4], 'c': [5, 6]})
print(data)

      a  b  c
0     1  3  5
1  <NA>  4  6

In [106]:
df = pd.DataFrame(data)
print(df)

      a  b  c
0     1  3  5
1  <NA>  4  6

In [107]:
# rename the coulmn name
df.columns = ['column1', 'column2', 'column3']

In [108]:
# Checking for null values
null_check = df.isnull()
null_check

   column1  column2  column3
0    False    False    False
1     True    False    False

In [109]:
# Checking for non-null values
notnull_check = df.notnull()
notnull_check

   column1  column2  column3
0     True     True     True
1    False     True     True

In [110]:
# Dropping rows if in a row null values
print(df.dropna())

  column1  column2  column3
0       1        3        5

In [111]:
# Dropping columns if in coulmn null values
print(df.dropna(axis=1))

   column2  column3
0        3        5
1        4        6

In [112]:
data = pd.DataFrame({
    'a': [pd.NA, pd.NA , pd.NA , pd.NA],
    'b': [3, 4 , 2 , 1],
    'c': [5, 6, 7, pd.NA],
    'd': [1, pd.NA, pd.NA, pd.NA]})
print(data)

      a  b     c     d
0  <NA>  3     5     1
1  <NA>  4     6  <NA>
2  <NA>  2     7  <NA>
3  <NA>  1  <NA>  <NA>

In [113]:
# Dropping columns with less than `n` non-null values
n = 3
print(data.dropna(axis=1, thresh=n))

   b     c
0  3     5
1  4     6
2  2     7
3  1  <NA>

In [114]:
# Filling null values with a specific value
data.fillna(0)

   a  b  c  d
0  0  3  5  1
1  0  4  6  0
2  0  2  7  0
3  0  1  0  0

In [115]:
data['d'].fillna(data['d'].mean()) #where null value available at that changed and mean value assigned

0    1.0
1    1.0
2    1.0
3    1.0
Name: d, dtype: float64

In [116]:
data

      a  b     c     d
0  <NA>  3     5     1
1  <NA>  4     6  <NA>
2  <NA>  2     7  <NA>
3  <NA>  1  <NA>  <NA>

In [117]:
data.columns = ['p','q','r','s'] #change coulmn names
data

      p  q     r     s
0  <NA>  3     5     1
1  <NA>  4     6  <NA>
2  <NA>  2     7  <NA>
3  <NA>  1  <NA>  <NA>

In [118]:
data = data.rename(columns={'a':'p'}) #rename the particular coulmn name
data

      p  q     r     s
0  <NA>  3     5     1
1  <NA>  4     6  <NA>
2  <NA>  2     7  <NA>
3  <NA>  1  <NA>  <NA>

In [119]:
data = data.replace([2,3],['two','three']) #replace values
data

      p      q     r     s
0  <NA>  three     5     1
1  <NA>      4     6  <NA>
2  <NA>    two     7  <NA>
3  <NA>      1  <NA>  <NA>

In [121]:
data.set_index('q')

          p     r     s
q
three  <NA>     5     1
4      <NA>     6  <NA>
two    <NA>     7  <NA>
1      <NA>  <NA>  <NA>

In [122]:
data

      p      q     r     s
0  <NA>  three     5     1
1  <NA>      4     6  <NA>
2  <NA>    two     7  <NA>
3  <NA>      1  <NA>  <NA>